Revit 2027 API
TransmissionData.DocumentIsNotTransmitted Method
 Determines whether the document at a given file location is not transmitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool DocumentIsNotTransmitted(
	ModelPath filePath
)
Public Shared Function DocumentIsNotTransmitted (
	filePath As ModelPath
) As Boolean
public:
static bool DocumentIsNotTransmitted(
	ModelPath^ filePath
)
static member DocumentIsNotTransmitted :
        filePath : ModelPath -> bool
Parameters
filePath ModelPath
 The path to the document whose transmitted state will be checked.
Return Value
Boolean
 False if the document is a transmitted file, true otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace